morze_dict = {"а":".-", "б":"-...","в":".--", "г":"--.", "д":"-..", "е":".", "ж":"...-", "з":"--..", "и":"..", "й":".---", "к":"-.-", "л":".-..",
"м":"--", "н":"-.", "о":"---", "п":".--.", "р":".-.", "с":"...", "т":"-", "у":"..-", "ф":"..-.", "х":"....", "ц":"-.-.", "ч":"---.",
"ш":"----", "щ":"--.-", "ъ":"--.--", "ы":"-.--", "ь":"-..-", "э":"..-..", "ю":"..--", "я":".-.-", " ":"-...-"}
d = []
for i in input().split():
    for key, value in morze_dict.items():
        if i == value:
            d.append(key)
print("".join(d))

# d =[k for i in input().split() for k, v in morze_dict.items() if v == i]
# print("".join(d))